xoseperez/espurna/code/espurna/arch/esp8266/telnet_esp8266.cpp
/*

TELNET MODULE

Copyright (C) 2017-2019 by Xose Pérez <xose dot perez at gmail dot com>
Copyright (C) 2019-2022 by Maxim Prokhorov <prokhorov dot max at outlook dot com>

Implements basic socket server & command interface. Name `TELNET` comes from the original implementation,
we don't implement IAC, there is no special byte escape happening and no buffering outside of line-view parser.

Updated to use LWIP APIs directly and avoid ESPAsyncTCP dependency altogether.
Given a chance, may get ported to non-blocking POSIX socket code.

Parts of the code have been borrowed from Thomas Sarlandie's NetServer
- https://github.com/sarfata/kbox-firmware/tree/master/src/esp

Buffered client class based on ESPAsyncTCPbuffer, distributed with the ESPAsyncTCP
- https://github.com/me-no-dev/ESPAsyncTCP/blob/master/src/ESPAsyncTCPbuffer.cpp

Updated to use WiFiServer and support reverse connections by Niek van der Maas <mail at niekvandermaas dot nl>
- https://github.com/xoseperez/espurna/pull/1920

*/

#include "../../espurna.h"

#if TELNET_SUPPORT

#include <ESP8266WiFi.h>

#if WEB_SUPPORT
#include "ws.h"
#endif

#include "mqtt.h"
#include "telnet.h"
#include "terminal.h"
#include "../../wifi_orch.h"

#include "libs/URL.h"
#include "libs/Delimiter.h"

#include <forward_list>
#include <list>
#include <vector>

namespace espurna {
namespace telnet {
namespace {

constexpr bool isEspurnaMinimal() {
#if defined(ESPURNA_MINIMAL_ARDUINO_OTA) || defined(ESPURNA_MINIMAL_WEBUI)
    return true;
#else
    return false;
#endif
}

namespace build {

constexpr size_t LineBufferSize { TELNET_LINE_BUFFER_SIZE };

constexpr size_t ClientsMax { TELNET_MAX_CLIENTS };
static_assert(ClientsMax > 0, "");

constexpr uint16_t port() {
    return TELNET_PORT;
}

constexpr bool station() {
    return 1 == TELNET_STA;
}

constexpr bool authentication() {
    return isEspurnaMinimal() ? false : (1 == TELNET_AUTHENTICATION);
}

} // namespace build

namespace settings {

STRING_VIEW_INLINE(Prefix, "telnet");

namespace keys {

PROGMEM_STRING(Station, "telnetSTA");
PROGMEM_STRING(Authentication, "telnetAuth");
PROGMEM_STRING(Port, "telnetPort");

} // namespace keys

String password() {
    return systemPassword();
}

bool station() {
    return getSetting(keys::Station, build::station());
}

bool authentication() {
    return password().length() && getSetting(keys::Authentication, build::authentication());
}

uint16_t port() {
    return getSetting(keys::Port, build::port());
}

namespace query {
namespace internal {

#define EXACT_VALUE(NAME, FUNC)\
String NAME () {\
    return espurna::settings::internal::serialize(FUNC());\
}

EXACT_VALUE(station, settings::station)
EXACT_VALUE(authentication, settings::authentication)
EXACT_VALUE(port, settings::port)

#undef EXACT_VALUE

} // namespace internal

static constexpr std::array<espurna::settings::query::Setting, 3> Settings PROGMEM {{
     {keys::Station, internal::station},
     {keys::Authentication, internal::authentication},
     {keys::Port, internal::port},
}};

bool checkExactPrefix(StringView key) {
    return key.startsWith(settings::Prefix);
}

espurna::settings::query::Result findFrom(StringView key) {
    return espurna::settings::query::findFrom(Settings, key);
}

void setup() {
    settingsRegisterQueryHandler({
        .check = checkExactPrefix,
        .get = findFrom,
    });
}

} // namespace query
} // namespace settings

// Generic TCP interface assumes we only have the network buffer available to us.
// Since we can't chain-in additional backing storage through the provided LWIP API,
// force every write to either go through the usual means or cache it using extra N
// u8 arrays that are created when writing data and then destroyed when it is sent
struct ClientWriter {
    size_t write(tcp_pcb* pcb, const uint8_t* data, size_t size) {
        if (!size || (pcb->state != ESTABLISHED)) {
            return 0;
        }

        int8_t flags = TCP_WRITE_FLAG_COPY;

        // first, trying to write directly into the network stack buffers
        size_t written = 0;
        if (_list.empty()) {
            size_t available = tcp_sndbuf(pcb);
            written = std::min(available, size);

            auto err = tcp_write(pcb, data, written, flags);
            if (err != ERR_OK) {
                return 0;
            }

            if (written == size) {
                return size;
            }
        }

        // second, cache the data on the app level
        size_t left { size - written };

        const auto* ptr = data + written;
        flags |= TCP_WRITE_FLAG_MORE;

        while (left) {
            if (_list.empty() && !make_buffer()) {
                break;
            }

            auto& current = _list.back();
            const auto have = current.capacity() - current.size();
            if (have < left) {
                current.insert(current.end(), ptr, ptr + have);
                if (!make_buffer()) {
                    break;
                }

                ptr += have;
                written += have;
                left -= have;
            } else {
                current.insert(current.end(), ptr, ptr + left);
                written = size;
                break;
            }
        }

        // to avoid dumping sources like printf("%02X ") in a loop immediately,
        // stall calling tcp_output until there's a large chunk of data available
        // plus, lwip loop & poll will dump things periodically
        if (!_list.empty()) {
            tcp_output(pcb);
        }

        return written;
    }

    size_t write(tcp_pcb* pcb, StringView data) {
        return write(pcb, reinterpret_cast<const uint8_t*>(data.c_str()), data.length());
    }

    void flush(tcp_pcb* pcb) {
        bool wrote { false };
        while (!_list.empty()) {
            auto& chunk = _list.front();

            const size_t available = tcp_sndbuf(pcb);
            if (available < chunk.size()) {
                break;
            }

            auto err = tcp_write(pcb, chunk.data(), chunk.size(), TCP_WRITE_FLAG_COPY);
            if (err != ERR_OK) {
                break;
            }

            wrote = true;
            _list.pop_front();
        }

        if (wrote) {
            tcp_output(pcb);
        }
    }

    size_t writable(tcp_pcb* pcb) const {
        return _list.empty() && (tcp_sndbuf(pcb) > 0);
    }

