xoseperez/espurna/code/espurna/arch/esp8266/telnet_esp8266.cpp
    void reset() {
        _list.clear();
    }

private:
    using Buffer = std::vector<uint8_t>;
    using List = std::list<Buffer>;

    constexpr static size_t BufferSize = TCP_MSS;
    constexpr static size_t BuffersMax =
        (BufferSize == 1460)
            ? 2  // MSS is 1460 bytes, additional 2920 bytes
            : 5; // MSS is 536 bytes, additional 2680 bytes

    bool make_buffer() {
        if (_list.size() < BuffersMax) {
            Buffer buffer;
            buffer.reserve(TCP_MSS);
            _list.push_back(std::move(buffer));
            return true;
        }

        return false;
    }

    List _list;
};

namespace message {

PROGMEM_STRING(PasswordRequest, "Password (disconnects after 1 failed attempt): ");
PROGMEM_STRING(InvalidPassword, "-ERROR: Invalid password\n");
PROGMEM_STRING(BufferOverflow, "-ERROR: Buffer overflow\n");
PROGMEM_STRING(OkPassword, "+OK\n");

} // namespace message

// Terminal output works through Arduino `Print` interface, and everything there uses basic `write`.
// Really really flush both network and internal buffer(s), or we stall our `loop` with the arbitrary
// timeout option it selects for us. (ref. Core files for more)
// Plus, we don't force either `Print` or `Stream` class inheritance for the `T`.
template <typename T>
struct ExhaustingPrint : public Print {
    ExhaustingPrint() = delete;
    explicit ExhaustingPrint(T* client) :
        _client(client)
    {}

    size_t write(const uint8_t* ptr, size_t length) override {
        flush();
        return _client->write(ptr, length);
    }

    size_t write(uint8_t c) override {
        return write(&c, 1);
    }

    // while in the main loop, attempt to flush everything gathered so far as soon as possible
    // currently, neither client state or flush result are checked by the caller
    void flush() override {
        auto flag = PolledFlag<time::CoreClock>();

        while (!flag.wait(duration::Seconds(3))
            && _client->connected()
            && !_client->writable())
        {
            _client->flush();
            time::blockingDelay(
                duration::Milliseconds(10));
        }
    }

private:
    T* _client;
};

struct Address {
    ip_addr_t ip;
    uint16_t port;
};

LineView line_view(pbuf* pb) {
    auto* payload = reinterpret_cast<const char*>(pb->payload);
    return LineView{
        StringView{payload, payload + pb->len}};
}

Address address(tcp_pcb* pcb) {
    Address out;
    ip_addr_copy(out.ip, pcb->remote_ip);
    out.port = pcb->remote_port;
    return out;
}

[[gnu::unused]]
String address_string(Address address) {
    return IPAddress(address.ip).toString() + ':' + String(address.port, 10);
}

// clean-up pcb data stream until telnet data ends
bool process_rfc854(pbuf* pb) {
    static constexpr uint8_t Iac { 0xff };

    static constexpr uint8_t Will { 0xfb };
    static constexpr uint8_t Wont { 0xfc };
    static constexpr uint8_t Do { 0xfd };
    static constexpr uint8_t Dont { 0xfe };

    static constexpr uint8_t Eof { 0xec };

    auto* ptr = reinterpret_cast<uint8_t*>(pb->payload);
    uint16_t len { pb->len };

    bool out { true };

    while (out && (len >= 2)) {
        switch (ptr[0]) {
        case Iac:
            switch (ptr[1]) {
            case Will:
            case Wont:
            case Do:
            case Dont:
                if (len >= 3) {
                    ptr += 3;
                    len -= 3;
                    continue;
                }

                break;

            case Eof:
                len = 0;
                out = false;
                ptr = nullptr;
                break;
            }

            break;
        }

        break;
    }

    pb->len = len;
    pb->payload = ptr;

    return out;
}

// tracks the provided TCP `pcb`, cannot instantiate one by itself
class Client {
public:
    Client() = delete;
    Client(tcp_pcb* pcb, bool auth) :
        _pcb(pcb),
        _remote(address(pcb)),
        _request_auth(auth)
    {
        // we could 'reap' certain low priority pcbs from
        // the active list by calling `tcp_kill_prio(LEVEL)`
        tcp_setprio(_pcb, TCP_PRIO_MIN);

        // TODO: any reason *not* to enable no-delay?
        tcp_nagle_enable(_pcb);

        // just like netconn aka socket api provided by lwip, we cross-reference
        // these two objects; pcb knows of `this` as `callback_arg`, we track the
        // `pcb` pointer and only remove it when connection closes or errors out
        tcp_arg(_pcb, this);
        tcp_sent(_pcb, s_on_tcp_sent);
        tcp_recv(_pcb, s_on_tcp_recv);
        tcp_err(_pcb, s_on_tcp_error);
        tcp_poll(_pcb, s_on_tcp_poll, 1);

        // sometimes we are already connected. e.g. server accept callback
        if (connected()) {
            _state = _request_auth
                ? State::Authenticating
                : State::Active;
        }
    }

    Client(const Client&) = delete;
    Client& operator=(const Client&) = delete;

    Client(Client&& other) = delete;
    Client& operator=(Client&&) = delete;

    ~Client() {
        close();
    }

    bool connect(Address address) {
        if (_pcb) {
            auto err = tcp_connect(
                _pcb,
                &address.ip,
                address.port,
                s_on_tcp_connected);

            if (err != ERR_OK) {
                return false;
            }

            _state = State::Connecting;
            return true;
        }

        return false;
    }

    bool connected() const {
        return _pcb && (_pcb->state == ESTABLISHED);
    }

    err_t abort() {
        return abort(ERR_ABRT);
    }

    err_t close() {
        err_t err = ERR_OK;
        if (_pcb) {
            detach();
            err = tcp_close(_pcb);
            if (err != ERR_OK) {
                err = abort();
            }

            DEBUG_MSG_P(PSTR("[TELNET] Disconnected %s\n"),
                address_string(_remote).c_str());

            _pcb = nullptr;
        }

