xoseperez/espurna/code/espurna/arch/esp8266/telnet_esp8266.cpp
        return err;
    }

    err_t error() const {
        return _last_err;
    }

    Address remote() const {
        return _remote;
    }

    size_t write(const uint8_t* data, size_t size) {
        if (_pcb && (_state == State::Active)) {
            return _writer.write(_pcb, data, size);
        }

        return 0;
    }

    void flush() {
        if (_pcb) {
            _writer.flush(_pcb);
        }
    }

    // whenever client was disconnected / left hanging
    bool closed() const {
        return _pcb == nullptr;
    }

    // our network & internal buffers are free
    bool writable() {
        if (_pcb) {
            return _writer.writable(_pcb);
        }

        return false;
    }

    void maybe_ask_auth() {
        if (_request_auth) {
            write_message(message::PasswordRequest);
        }
    }

#if TERMINAL_SUPPORT
    void process() {
        while (!_cmds.empty()) {
            auto cmd = std::move(_cmds.front());
            _cmds.pop_front();

            ExhaustingPrint<Client> print(this);
            if (!espurna::terminal::api_find_and_call(cmd, print)) {
                _cmds.clear();
                break;
            }
        }
    }
#endif

private:
    // can't use an arbitrary `pbuf` with `tcp_write`, since this may
    // be a flash string and without `memcpy_P` we can't read it.
    void write_message(StringView message) {
        if (_pcb) {
            const auto blob = String(message);
            _writer.write(_pcb, blob);
        }
    }

    err_t abort(err_t err) {
        detach();
        _pcb = nullptr;
        _state = State::Idle;
        _last_err = err;
        _writer.reset();
        _cmds.clear();

        DEBUG_MSG_P(PSTR("[TELNET] %s ERROR %s\n"),
            address_string(_remote).c_str(),
#if LWIP_DEBUG
            lwip_strerr(err));
#else
            String(int(err), 10).c_str());
#endif

        return ERR_ABRT;
    }

    void detach() {
        if (_pcb) {
            tcp_arg(_pcb, nullptr);
            tcp_sent(_pcb, nullptr);
            tcp_recv(_pcb, nullptr);
            tcp_err(_pcb, nullptr);
            tcp_poll(_pcb, nullptr, 0);
        }
    }

    static void s_on_tcp_error(void* arg, err_t err) {
        reinterpret_cast<Client*>(arg)->abort(err);
    }

    // TODO: timeout when buffers are filled for a long time?
    static err_t s_on_tcp_poll(void* arg, tcp_pcb*) {
        reinterpret_cast<Client*>(arg)->flush();
        return ERR_OK;
    }

    // no need to check len, since write() copied the data and already advanced the buffer
    // (COPY flag is implicitly enabled, so *not* passing it / flagging as 0 is irrelevant)
    static err_t s_on_tcp_sent(void* arg, tcp_pcb*, uint16_t) {
        reinterpret_cast<Client*>(arg)->flush();
        return ERR_OK;
    }

#if TERMINAL_SUPPORT
    void process(String cmd) {
        _cmds.push_back(std::move(cmd));
    }
#endif

    struct ProcessLineResult {
        StringView message;
        bool close { false };
    };

    auto process_line(StringView line) -> ProcessLineResult {
        ProcessLineResult out;
        if (!line.length()) {
            return out;
        }

        switch (_state) {
        case State::Idle:
        case State::Connecting:
            break;
        case State::Active:
#if TERMINAL_SUPPORT
            process(line.toString());
#endif
            break;
        case State::Authenticating:
            if (!systemPasswordEquals(stripNewline(line))) {
                out.message = StringView{message::InvalidPassword};
                out.close = true;
                return out;
            }

            out.message = StringView{message::OkPassword};
            _state = State::Active;
            break;
        }

        return out;
    }

    err_t on_tcp_recv(pbuf* pb, err_t err) {
        if (!pb || (err != ERR_OK)) {
            return close();
        }

        // We always attempt to parse the network buffer directly first,
        // socat, netcat, etc. usually send a single packet per line.
        // Otherwise, try to buffer it and everything else in the chain.
        for (auto it = pb; it != nullptr; it = it->next) {
            // In case connection happens from an actual telnet client
            if (!process_rfc854(pb)) {
                return close();
            }

            auto view = line_view(it);
            if (_line_buffer.size()) {
                goto next;
            }

            for (auto line = view.next(); line.length() > 0; line = view.next()) {
                auto result = process_line(line);
                if (result.message.length()) {
                    write_message(result.message);
                }

                if (result.close) {
                    return close();
                }
            }

next:
            if (view.length()) {
                _line_buffer.append(view.get());
            }
        }

        if (_line_buffer.overflow()) {
            write_message(message::BufferOverflow);
            return close();
        }

        for (;;) {
            const auto line_result = _line_buffer.next();
            if (line_result.overflow) {
                write_message(message::BufferOverflow);
                return close();
            }

            if (!line_result.value.length()) {
                break;
            }

            auto result = process_line(line_result.value);
            if (result.message.length()) {
                write_message(result.message);
            }

            if (result.close) {
                return close();
            }
        }

        // expect everything to be handled above, we don't allow lingering pbufs
        // (as extra buffers, for retries, or anything else)
        tcp_recved(_pcb, pb->tot_len);
        pbuf_free(pb);

        return ERR_OK;
    }

    static err_t s_on_tcp_recv(void* arg, tcp_pcb*, pbuf* pb, err_t err) {
        return reinterpret_cast<Client*>(arg)->on_tcp_recv(pb, err);
    }

    err_t on_tcp_connected() {
        _state = _request_auth
            ? State::Authenticating
            : State::Active;
        maybe_ask_auth();
        return ERR_OK;
    }

