xoseperez/espurna/code/espurna/arch/esp8266/telnet_esp8266.cpp
    static err_t s_on_tcp_connected(void* arg, tcp_pcb*, err_t) {
        return reinterpret_cast<Client*>(arg)->on_tcp_connected();
    }

    enum class State {
        Idle,
        Connecting,
        Authenticating,
        Active,
    };

    tcp_pcb* _pcb;
    Address _remote;

    err_t _last_err { ERR_OK };

    State _state { State::Idle };
    bool _request_auth { false };

#if TERMINAL_SUPPORT
    LineBuffer<build::LineBufferSize> _line_buffer;
    std::list<String> _cmds;
#endif
    ClientWriter _writer;
};

using ClientPtr = std::unique_ptr<Client>;

template <size_t Size>
struct Clients {
    using List = std::forward_list<ClientPtr>;

    bool connected() {
        const auto it = std::find_if(
            std::begin(_clients),
            std::end(_clients),
            [](const ClientPtr& ptr) {
                return static_cast<bool>(ptr);
            });

        return it != std::end(_clients);
    }

    Client* add(ClientPtr&& client) {
        for (auto& entry : _clients) {
            if (!entry || entry->closed()) {
                entry = std::move(client);
                return entry.get();
            }
        }

        return nullptr;
    }

    bool write(const uint8_t* data, size_t len) {
        size_t out = 0;
        for (auto& client : _clients) {
            if (client && client->connected()) {
                out += client->write(data, len);
            }
        }

        return out > 0;
    }

    bool write(const char* data, size_t len) {
        return write(reinterpret_cast<const uint8_t*>(data), len);
    }

    bool write(StringView data) {
        return write(data.data(), data.length());
    }

    void process() {
        for (auto& client : _clients) {
            if (client) {
                client->process();
            }
        }
    }

    void flush() {
        for (auto& client : _clients) {
            if (client) {
                client->flush();
            }
        }
    }

    template <typename T>
    void foreach(T&& callback) {
        for (auto& client : _clients) {
            if (client) {
                callback(client);
            }
        }
    }

private:
    ClientPtr _clients[Size];
};

template <>
struct Clients<1> {
    bool connected() {
        return static_cast<bool>(_client);
    }

    Client* add(ClientPtr&& client) {
        if (!_client || _client->closed()) {
            _client = std::move(client);
            return _client.get();
        }

        return nullptr;
    }

    bool write(const uint8_t* data, size_t len) {
        if (_client && _client->connected()) {
            return _client->write(data, len) > 0;
        }

        return false;
    }

    bool write(const char* data, size_t len) {
        return write(reinterpret_cast<const uint8_t*>(data), len);
    }

    bool write(StringView data) {
        return write(data.data(), data.length());
    }

    void process() {
        if (_client) {
            _client->process();
        }
    }

    void flush() {
        if (_client) {
            _client->flush();
        }
    }

    template <typename T>
    void foreach(T&& callback) {
        if (_client) {
            callback(_client);
        }
    }

private:
    ClientPtr _client;
};

namespace internal {

Clients<build::ClientsMax> clients;

} // namespace internal

bool add(ClientPtr client) {
    auto result = internal::clients.add(std::move(client));
    if (result) {
        DEBUG_MSG_P(PSTR("[TELNET] Connected %s\n"),
            address_string(result->remote()).c_str());
        result->maybe_ask_auth();
        return true;
    }

    client->abort();
    DEBUG_MSG_P(PSTR("[TELNET] Rejecting %s\n"),
        address_string(client.get()->remote()).c_str());

    return false;
}

bool connected() {
    return internal::clients.connected();
}

bool write(const char* data, size_t len) {
    return internal::clients.write(data, len);
}

void flush() {
    internal::clients.flush();
}

void process() {
    internal::clients.process();
}

// lwip backlog allows to limit the amount of connected pcbs,
// and needs to be explicitly delayed / accepted:
// > tcp_backlog_delayed(pcb);
// > tcp_backlog_accepted(pcb);
//
// note that b/c of the reverse use-case, this cannot be the only
// way to count the clients
// (however, it may be useful to remove restriction on the reverse)

ClientPtr make_client(tcp_pcb* pcb, bool request_auth) {
    return std::make_unique<Client>(pcb, request_auth);
}

err_t accept(void*, tcp_pcb* pcb, err_t err) {
    if (!pcb || (err != ERR_OK)) {
        return ERR_VAL;
    }

    auto sta = settings::station();
    if (!sta && wifiConnected()) {
        auto ip = wifiStaIp();
        if (ip == pcb->local_ip) {
            return ERR_VAL;
        }
    }

    if (add(make_client(pcb, settings::authentication()))) {
        return ERR_OK;
    }

    return ERR_MEM;
}

bool listen() {
    auto* pcb = tcp_new();
    if (!pcb) {
        return false;
    }

    pcb->so_options |= SOF_REUSEADDR;
    if (tcp_bind(pcb, IP_ADDR_ANY, settings::port()) != ERR_OK) {
        tcp_close(pcb);
        return false;
    }

    pcb = tcp_listen(pcb);
    if (!pcb) {
        tcp_close(pcb);
        return false;
    }

    tcp_accept(pcb, accept);
    DEBUG_MSG_P(PSTR("[TELNET] Listening on port %hu\n"), pcb->local_port);

    return true;
}

#if TELNET_REVERSE_SUPPORT
namespace reverse {

bool connect(Address address) {
    auto* pcb = tcp_new();
    if (!pcb) {
        return false;
    }

    // wait until the connection attempt happens
    // or, we could also fail right here as well
    auto client = make_client(pcb, false);
    if (!client->connect(address)) {
        return false;
    }

    // we can't stall here, make use of the storage
    if (add(std::move(client))) {
        return true;
    }

    return false;
}

#if TERMINAL_SUPPORT
namespace terminal {
namespace commands {

PROGMEM_STRING(Reverse, "TELNET.REVERSE");

void reverse(::terminal::CommandContext&& ctx) {
    if (ctx.argv.size() != 3) {
        terminalError(ctx, F("TELNET.REVERSE <HOST> <PORT>"));
        return;
    }

    const auto ip = network::dns::gethostbyname(ctx.argv[1]);
    if (!ip.isSet()) {
        terminalError(ctx, F("Host not found"));
        return;
    }

    const auto convert_port = espurna::settings::internal::convert<uint16_t>;
    auto port = convert_port(ctx.argv[2]);
    if (!port) {
        terminalError(ctx, F("Invalid port"));
        return;
    }

