xoseperez/espurna/code/espurna/arch/esp8266/telnet_esp8266.cpp
    const auto address = Address{
        .ip = ip,
        .port = port,
    };

    if (connect(address)) {
        terminalOK(ctx);
        return;
    }

    terminalError(ctx, F("Unable to connect"));
}

static constexpr ::terminal::Command List[] PROGMEM {
    {Reverse, commands::reverse},
};

} // namespace commands

void setup() {
    espurna::terminal::add(commands::List);
}

} // namespace terminal
#endif

#if MQTT_SUPPORT
namespace mqtt {

void connect_url(String url) {
    URL parsed(std::move(url));
    if (!parsed.host.length() || !parsed.port) {
        DEBUG_MSG_P(PSTR("[TELNET] Cannot parse the url\n"));
        return;
    }

    const auto port = parsed.port;
    network::dns::resolve(
        std::move(parsed.host),
        [port](network::dns::HostPtr host) {
            if (host->err == ERR_OK) {
                const auto addr = Address{
                    .ip = host->addr,
                    .port = port,
                };

                if (connect(addr)) {
                    return;
                }
            }

            DEBUG_MSG_P(PSTR("[TELNET] Cannot connect to %s:%hu\n"),
                host->name.c_str(), port);
        });
}

void setup() {
    mqttRegister([](unsigned int type, StringView topic, StringView payload) {
        switch (type) {
        case MQTT_CONNECT_EVENT:
            mqttSubscribe(MQTT_TOPIC_TELNET_REVERSE);
            break;

        case MQTT_MESSAGE_EVENT: {
            auto t = mqttMagnitude(topic);
            if (t.equals(MQTT_TOPIC_TELNET_REVERSE)) {
                connect_url(payload.toString());
            }
            break;
        }

        }
    });
}

} // namespace mqtt
#endif // MQTT_SUPPORT

void setup() {
#if TERMINAL_SUPPORT
    terminal::setup();
#endif
#if MQTT_SUPPORT
    mqtt::setup();
#endif
}

} // namespace reverse
#endif // TELNET_REVERSE_SUPPORT

#if WEB_SUPPORT
namespace web {

bool onKeyCheck(espurna::StringView key, const JsonVariant&) {
    return settings::query::checkExactPrefix(key);
}

void onVisible(JsonObject& root) {
    wsPayloadModule(root, settings::Prefix);
}

void onConnected(JsonObject& root) {
    for (auto setting : settings::query::Settings) {
        root[setting.key()] = setting.value();
    }
}

void setup() {
    wsRegister()
        .onKeyCheck(onKeyCheck)
        .onVisible(onVisible)
        .onConnected(onConnected);
}

} // namespace web
#endif

void setup() {
#if TELNET_REVERSE_SUPPORT
    reverse::setup();
#endif
#if WEB_SUPPORT
    web::setup();
#endif

    listen();

    settings::query::setup();

    ::espurnaRegisterLoop([]() {
        flush();
        process();
    });
}

} // namespace
} // namespace telnet
} // namespace espurna

uint16_t telnetPort() {
    return espurna::telnet::settings::port();
}

bool telnetConnected() {
    return espurna::telnet::connected();
}

bool telnetDebugSend(const DebugPrefix& prefix, const char* message, size_t length) {
    size_t out = 0;

    if (telnetConnected()) {
        if (debugWithPrefix(prefix)) {
            out += espurna::telnet::write(prefix, debugPrefixLength(prefix));
        }

        out += espurna::telnet::write(message, length);
    }

    return out > 0;
}

void telnetSetup() {
    espurna::telnet::setup();
}

#endif

